"""
Закрепить знания по созданию модульных приложений.
Создать прототип интерактивной базы данных, содержащую информацию о сотрудниках некой компании \ студентах вуза \
учениках школы в виде одной таблицы (кто желает может создать несколько связанных таблиц или полноценную базу данных)

Программа должна иметь возможность изменять данные (редактировать добавлять, удалять),
осуществлять сохранение и загрузку. А также выводить данные в консоль.
Добавить логирование. Упорядочить вывод в консоль, сделать его красивым.

Данный модуль – точка входа приложения
"""
'В этом дз уже сделано не столбиком, списками как и требовалось. '
'К сожалению победить библиотеки пока так и не удалось, но я не сдамся.'
'Надеюсь все ошибки предусмотрел ^_^'

from controller import start

start()
